#+TITLE: Lecture 2: Review of Probability
#+AUTHOR: Zheng Tian
#+EMAIL: zngtian@gmail.com
#+DATE:
#+OPTIONS: H:3 num:1 toc:1

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1000 reveal_height:800

#+REVEAL_ROOT: ../../../reveal.js
#+REVEAL_MARGIN: 0.2
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: cube
#+REVEAL_THEME: beige
#+REVEAL_HLEVEL: 2
#+REVEAL_PLUGINS: (highlight notes zoom)
#+REVEAL_EXTRA_JS:  { src: '../../../reveal.js/plugin/menu/menu.js' }


*** An example of the probability distribution of a discrete random variable

#+ATTR_LATEX: :booktabs t
#+NAME: tab-pmf-exmp
#+CAPTION: An illustration of the probability distribution of a discrete random variable
| $X$             |    1 |    2 |    3 | Sum |
|-----------------+------+------+------+-----|
| $\mathrm{P}(x)$ | 0.25 | 0.75 | 0.25 |  1  |
#+TBLFM: @2$5=vsum($2..$INVALID)

